
#+OPTIONS: ^:nil

** 字符串
字符创用单引号 =‘ ‘= 、双引号 =“ “= 、三引号 =‘‘‘ ‘‘‘= 表示

单引号可以嵌入到双引号和三引号，双引号可以嵌入到三引号里面

三引号可以用于表示分行的字符串
#+BEGIN_SRC python :results output :exports both
str2="a 'b' c"
print(str2) 

str3='''he said:''hello'' '''
print(str3)
#+END_SRC

#+RESULTS:
: a 'b' c
: he said:''hello'' 
** 变量的指向问题
这个跟c语言是一样的
#+BEGIN_SRC python :results output :exports both
a="hello python"
b=a
a=123
print(b)
#+END_SRC

#+RESULTS:
: hello python
